Revit 2026 API

# InstanceVoidCutUtilsAddInstanceVoidCut Method

---

Add a cut to an element using the unattached voids inside a cutting instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void AddInstanceVoidCut(
	Document document,
	Element element,
	Element cuttingInstance
)
```
```vb
Public Shared Sub AddInstanceVoidCut (
	document As Document,
	element As Element,
	cuttingInstance As Element
)
```
```cpp
public:
static void AddInstanceVoidCut(
	Document^ document,
	Element^ element,
	Element^ cuttingInstance
)
```
```fsharp
static member AddInstanceVoidCut :
        document : Document *
        element : Element *
        cuttingInstance : Element -> unit
```

#### Parameters

document Document
     The document containing the two elements
element Element
     The element to be cut
cuttingInstance Element
     The cutting family instance

| Exception | Condition |
| --- | --- |
| ArgumentException | The element cannot be cut with a void instance. -or- The element is not a family instance with an unattached void that can cut. |
| ArgumentNullException | A non-optional argument was null |
| ForbiddenForDynamicUpdateException | This method may not be called during dynamic update. |
| InvalidOperationException | Failed to cut element with the instances |

#### Reference

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace